src/InformationRegisters/Scan_OrderIntake/Scan_OrderIntake.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_OrderIntake</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ИспользоватьВОтчетах</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ИдентификаторЗаписи</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКорректировки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаказНаЗавод</name>
    <type>
      <types>CatalogRef.Scan_ЗаказыНаЗавод</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДаты</name>
    <type>
      <types>EnumRef.Scan_ДатыДляФормированияОтчетаOI</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_OrderIntake/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	//rarus vikhle 22.03.2021 mt 17479 +++
	Для Каждого Запись Из ЭтотОбъект Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Scan_OrderIntake.Период КАК Период,
		               |	Scan_OrderIntake.ЗаказНаЗавод КАК ЗаказНаЗавод,
		               |	Scan_OrderIntake.ВидДаты КАК ВидДаты,
		               |	Scan_OrderIntake.ИспользоватьВОтчетах КАК ИспользоватьВОтчетах,
		               |	Scan_OrderIntake.ИдентификаторЗаписи КАК ИдентификаторЗаписи
		               |ИЗ
		               |	РегистрСведений.Scan_OrderIntake КАК Scan_OrderIntake
		               |ГДЕ
		               |	Scan_OrderIntake.Период = &Период
		               |	И Scan_OrderIntake.ЗаказНаЗавод = &ЗаказНаЗавод
		               |	И Scan_OrderIntake.ВидДаты = &ВидДаты";
		Запрос.УстановитьПараметр("Период",Запись.Период);
		Запрос.УстановитьПараметр("ЗаказНаЗавод",Запись.ЗаказНаЗавод);
		Запрос.УстановитьПараметр("ВидДаты",Запись.ВидДаты);
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			Если НЕ ЗначениеЗаполнено(Выборка.ИдентификаторЗаписи) Тогда 
				Запись.ИдентификаторЗаписи = Новый УникальныйИдентификатор;	
			Иначе
				Запись.ИдентификаторЗаписи = Выборка.ИдентификаторЗаписи;	
			КонецЕсли;
		Иначе
			Запись.ИдентификаторЗаписи = Новый УникальныйИдентификатор;	
		КонецЕсли;	
		
	КонецЦикла;	
	//rarus vikhle 22.03.2021 mt 17479 ---
КонецПроцедуры
